vedderb/vesc_bms_fw/ChibiOS_20.3.4/community/os/hal/ports/GD/GD32VF103/OTG/gd32_otg.h
/**
 * @name HPTFQSTAT register bit definitions
 * @{
 */
#define HPTFQSTAT_PTXREQT_MASK    (0xFFU<<24) /**< Top of the periodic
                                                 transmit request queue
                                                 mask.                      */
#define HPTFQSTAT_PTXREQT(n)      ((n)<<24)   /**< Top of the periodic
                                                 transmit request queue
                                                 value.                     */
#define HPTFQSTAT_PTXREQS_MASK    (0xFF<<16)  /**< Periodic transmit request
                                                 queue Space Available
                                                 mask.                      */
#define HPTFQSTAT_PTXREQS(n)      ((n)<<16)   /**< Periodic transmit request
                                                 queue Space Available
                                                 value.                     */
#define HPTFQSTAT_PTXFS_MASK   (0xFFFF<<0) /**< Periodic transmit Data
                                                 FIFO Space Available
                                                 mask.                      */
#define HPTFQSTAT_PTXFS(n)     ((n)<<0)    /**< Periodic transmit Data
                                                 FIFO Space Available
                                                 value.                     */
/** @} */

/**
 * @name HACHINT register bit definitions
 * @{
 */
#define HACHINT_HACHINT_MASK        (0xFFFFU<<0)/**< Channel interrupts mask.   */
#define HACHINT_HACHINT(n)          ((n)<<0)    /**< Channel interrupts value.  */
/** @} */

/**
 * @name HACHINTEN register bit definitions
 * @{
 */
#define HACHINTEN_CINTEN_MASK    (0xFFFFU<<0)/**< Channel interrupt mask
                                                 mask.                      */
#define HACHINTEN_CINTEN(n)      ((n)<<0)    /**< Channel interrupt mask
                                                 value.                     */
/** @} */

/**
 * @name HPCS register bit definitions
 * @{
 */
#define HPCS_PS_MASK          (3U<<17)    /**< Port speed mask.           */
#define HPCS_PS_FS            (1U<<17)    /**< Full speed value.          */
#define HPCS_PS_LS            (2U<<17)    /**< Low speed value.           */
#define HPCS_PP               (1U<<12)    /**< Port power.                */
#define HPCS_PLST_MASK         (3U<<11)    /**< Port Line status mask.     */
#define HPCS_PLST_DM           (1U<<11)    /**< Logic level of D-.         */
#define HPCS_PLST_DP           (1U<<10)    /**< Logic level of D+.         */
#define HPCS_PRST               (1U<<8)     /**< Port reset.                */
#define HPCS_PSP              (1U<<7)     /**< Port suspend.              */
#define HPCS_PREM               (1U<<6)     /**< Port Resume.               */
#define HPCS_PEDC            (1U<<3)     /**< Port enable/disable change.*/
#define HPCS_PE               (1U<<2)     /**< Port enable.               */
#define HPCS_PCD              (1U<<1)     /**< Port Connect detected.     */
#define HPCS_PCST              (1U<<0)     /**< Port connect status.       */
/** @} */

/**
 * @name HCHCTL register bit definitions
 * @{
 */
#define HCHCTL_CEN            (1U<<31)    /**< Channel enable.            */
#define HCHCTL_CDIS            (1U<<30)    /**< Channel Disable.           */
#define HCHCTL_ODDFRM           (1U<<29)    /**< Odd frame.                 */
#define HCHCTL_DAR_MASK         (0x7FU<<22) /**< Device Address mask.       */
#define HCHCTL_DAR(n)           ((n)<<22)   /**< Device Address value.      */
#define HCHCTL_EPTYP_MASK       (3U<<18)    /**< Endpoint type mask.        */
#define HCHCTL_EPTYP(n)         ((n)<<18)   /**< Endpoint type value.       */
#define HCHCTL_EPTYP_CTL        (0U<<18)    /**< Control endpoint value.    */
#define HCHCTL_EPTYP_ISO        (1U<<18)    /**< Isochronous endpoint value.*/
#define HCHCTL_EPTYP_BULK       (2U<<18)    /**< Bulk endpoint value.       */
#define HCHCTL_EPTYP_INTR       (3U<<18)    /**< Interrupt endpoint value.  */
#define HCHCTL_LSD            (1U<<17)    /**< Low-Speed device.          */
#define HCHCTL_EPDIR            (1U<<15)    /**< Endpoint direction.        */
#define HCHCTL_EPNUM_MASK       (15U<<11)   /**< Endpoint number mask.      */
#define HCHCTL_EPNUM(n)         ((n)<<11)   /**< Endpoint number value.     */
#define HCHCTL_MPL_MASK         (0x7FFU<<0) /**< Maximum packet size mask.  */
#define HCHCTL_MPL(n)           ((n)<<0)    /**< Maximum packet size value. */
/** @} */

/**
 * @name HCHINTF register bit definitions
 * @{
 */
#define HCHINTF_DTER             (1U<<10)    /**< Data toggle error.         */
#define HCHINTF_REQOVR             (1U<<9)     /**< Frame overrun.             */
#define HCHINTF_BBER             (1U<<8)     /**< Babble error.              */
#define HCHINTF_USBER             (1U<<7)     /**< Transaction Error.         */
#define HCHINTF_ACK               (1U<<5)     /**< ACK response
                                                 received/transmitted
                                                 interrupt.                 */
#define HCHINTF_NAK               (1U<<4)     /**< NAK response received
                                                 interrupt.                 */
#define HCHINTF_STALL             (1U<<3)     /**< STALL response received
                                                 interrupt.                 */
#define HCHINTF_CH               (1U<<1)     /**< Channel halted.            */
#define HCHINTF_TF              (1U<<0)     /**< Transfer completed.        */
/** @} */

/**
 * @name HCHINTEN register bit definitions
 * @{
 */
#define HCHINTEN_DTERIE         (1U<<10)    /**< Data toggle error mask.    */
#define HCHINTEN_REQOVRIE         (1U<<9)     /**< Frame overrun mask.        */
#define HCHINTEN_BBERIE         (1U<<8)     /**< Babble error mask.         */
#define HCHINTEN_USBERIE         (1U<<7)     /**< Transaction error mask.    */
#define HCHINTEN_ACKIE           (1U<<5)     /**< ACK Response
                                                 received/transmitted
                                                 interrupt mask.            */
#define HCHINTEN_NAKIE           (1U<<4)     /**< NAK response received
                                                 interrupt mask.            */
#define HCHINTEN_STALLIE         (1U<<3)     /**< STALL response received
                                                 interrupt mask.            */
#define HCHINTEN_CHIE           (1U<<1)     /**< Channel halted mask.       */
#define HCHINTEN_TFIE          (1U<<0)     /**< Transfer completed mask.   */
/** @} */

/**
 * @name HCHLEN register bit definitions
 * @{
 */
#define HCHLEN_DPID_MASK        (3U<<29)    /**< PID mask.                  */
#define HCHLEN_DPID_DATA0       (0U<<29)    /**< DATA0.                     */
#define HCHLEN_DPID_DATA2       (1U<<29)    /**< DATA2.                     */
#define HCHLEN_DPID_DATA1       (2U<<29)    /**< DATA1.                     */
#define HCHLEN_DPID_MDATA       (3U<<29)    /**< MDATA.                     */
#define HCHLEN_DPID_SETUP       (3U<<29)    /**< SETUP.                     */
#define HCHLEN_PCNT_MASK      (0x3FFU<<19)/**< Packet count mask.         */
#define HCHLEN_PCNT(n)        ((n)<<19)   /**< Packet count value.        */
#define HCHLEN_TLEN_MASK      (0x7FFFF<<0)/**< Transfer size mask.        */
#define HCHLEN_TLEN(n)        ((n)<<0)    /**< Transfer size value.       */
/** @} */

/**
 * @name DCFG register bit definitions
 * @{
 */
#define DCFG_EOPFT_MASK         (3U<<11)    /**< Periodic frame interval
                                                 mask.                      */
#define DCFG_EOPFT(n)           ((n)<<11)   /**< Periodic frame interval
                                                 value.                     */
#define DCFG_DAR_MASK           (0x7FU<<4)  /**< Device address mask.       */
#define DCFG_DAR(n)             ((n)<<4)    /**< Device address value.      */
#define DCFG_NZLSOH           (1U<<2)     /**< Non-Zero-Length status
                                                 OUT handshake.             */
#define DCFG_DS_MASK          (3U<<0)     /**< Device speed mask.         */
#define DCFG_DS_FS11          (3U<<0)     /**< Full speed (USB 1.1
                                                 transceiver clock is 48
                                                 MHz).                      */
/** @} */

/**
 * @name DCTL register bit definitions
 * @{
 */
#define DCTL_POIF           (1U<<11)    /**< Power-on programming done. */
#define DCTL_CGONAK             (1U<<10)    /**< Clear global OUT NAK.      */
#define DCTL_SGONAK             (1U<<9)     /**< Set global OUT NAK.        */
#define DCTL_CGINAK             (1U<<8)     /**< Clear global non-periodic
                                                 IN NAK.                    */
#define DCTL_SGINAK             (1U<<7)     /**< Set global non-periodic
                                                 IN NAK.                    */
#define DCTL_GONS             (1U<<3)     /**< Global OUT NAK status.     */
#define DCTL_GINS             (1U<<2)     /**< Global non-periodic IN
                                                 NAK status.                */
#define DCTL_SD               (1U<<1)     /**< Soft disconnect.           */
#define DCTL_RWKUP             (1U<<0)     /**< Remote wakeup signaling.   */
/** @} */

/**
 * @name DSTAT register bit definitions
 * @{
 */
#define DSTAT_FNRSOF_MASK         (0x3FFU<<8) /**< Frame number of the received
                                                 SOF mask.                  */
#define DSTAT_FNRSOF(n)           ((n)<<8)    /**< Frame number of the received
                                                 SOF value.                 */
#define DSTAT_FNRSOF_ODD          (1U<<8)     /**< Frame parity of the received
                                                 SOF value.                 */
#define DSTAT_ES_MASK       (3U<<1)     /**< Enumerated speed mask.     */
#define DSTAT_ES_FS_48      (3U<<1)     /**< Full speed (PHY clock is
                                                 running at 48 MHz).        */
#define DSTAT_SPST            (1U<<0)     /**< Suspend status.            */
/** @} */

/**
 * @name DIEPINTF register bit definitions
 * @{
 */
#define DIEPINTF_IEPNEEN           (1U<<6)     /**< Transmit FIFO empty mask.  */
#define DIEPINTF_EPTXFUDEN       (1U<<4)     /**< IN token received when
                                                 TxFIFO empty mask.         */
#define DIEPINTF_CITOEN            (1U<<3)     /**< Timeout condition mask.    */
#define DIEPINTF_EPDISEN            (1U<<1)     /**< Endpoint disabled
                                                 interrupt mask.            */
#define DIEPINTF_TFEN           (1U<<0)     /**< Transfer completed
                                                 interrupt mask.            */
/** @} */

/**
 * @name DOEPINTF register bit definitions
 * @{
 */
#define DOEPINTF_BTBSTPEN      (1U<<6)     /**< Back-to-back Setup packets
                                                 interrupt enable bit */
#define DOEPINTF_EPRXFOVREN          (1U<<4)     /**< OUT token received when
                                                 endpoint disabled mask.    */
#define DOEPINTF_STPFEN           (1U<<3)     /**< SETUP phase done mask.     */
#define DOEPINTF_EPDISEN            (1U<<1)     /**< Endpoint disabled
                                                 interrupt mask.            */
#define DOEPINTF_TFEN           (1U<<0)     /**< Transfer completed
                                                 interrupt mask.            */
/** @} */

/**
 * @name DAEPINT register bit definitions
 * @{
 */
#define DAEPINT_OEPITB_MASK       (0xFFFFU<<16)/**< OUT endpoint interrupt
                                                 bits mask.                 */
#define DAEPINT_OEPITB(n)         ((n)<<16)   /**< OUT endpoint interrupt
                                                 bits value.                */
#define DAEPINT_IEPITB_MASK       (0xFFFFU<<0)/**< IN endpoint interrupt
                                                 bits mask.                 */
#define DAEPINT_IEPITB(n)         ((n)<<0)    /**< IN endpoint interrupt
                                                 bits value.                */
/** @} */

/**
 * @name DAEPINTEN register bit definitions
 * @{
 */
#define DAEPINTEN_OEPIE_MASK      (0xFFFFU<<16)/**< OUT EP interrupt mask
                                                 bits mask.                 */
#define DAEPINTEN_OEPIE(n)        (1U<<(16+(n)))/**< OUT EP interrupt mask
                                                 bits value.                */
#define DAEPINTEN_IEPIE_MASK      (0xFFFFU<<0)/**< IN EP interrupt mask
                                                 bits mask.                 */
#define DAEPINTEN_IEPIE(n)        (1U<<(n))   /**< IN EP interrupt mask
                                                 bits value.                */
/** @} */

/**
 * @name DVBUSDT register bit definitions
 * @{
 */
#define DVBUSDT_DVBUSDT_MASK    (0xFFFFU<<0)/**< Device VBUS discharge
                                                 time mask.                 */
#define DVBUSDT_DVBUSDT(n)      ((n)<<0)    /**< Device VBUS discharge
                                                 time value.                */
/** @} */

/**
 * @name DVBUSPT register bit definitions
 * @{
 */
#define DVBUSPT_DVBUSPT_MASK  (0xFFFU<<0) /**< Device VBUSpulsing time
                                                 mask.                      */
#define DVBUSPT_DVBUSPT(n)    ((n)<<0)    /**< Device VBUS pulsing time
                                                 value.                     */
/** @} */

/**
 * @name DIEPFEINTEN register bit definitions
 * @{
 */
#define DIEPFEINTEN_IEPTXFEIE(n) (1U<<(n))   /**< IN EP Tx FIFO empty
                                                 interrupt mask bit.        */
/** @} */

/**
 * @name DIEPCTL register bit definitions
 * @{
 */
#define DIEPCTL_EPEN           (1U<<31)    /**< Endpoint enable.           */
#define DIEPCTL_EPD           (1U<<30)    /**< Endpoint disable.          */
#define DIEPCTL_SD1PID          (1U<<29)    /**< Set DATA1 PID.             */
#define DIEPCTL_SODDFRM         (1U<<29)    /**< Set odd frame.             */
#define DIEPCTL_SD0PID          (1U<<28)    /**< Set DATA0 PID.             */
#define DIEPCTL_SEVENFRM         (1U<<28)    /**< Set even frame.            */
#define DIEPCTL_SNAK            (1U<<27)    /**< Set NAK.                   */
#define DIEPCTL_CNAK            (1U<<26)    /**< Clear NAK.                 */
#define DIEPCTL_TXFNUM_MASK     (15U<<22)   /**< TxFIFO number mask.        */
#define DIEPCTL_TXFNUM(n)       ((n)<<22)   /**< TxFIFO number value.       */
#define DIEPCTL_STALL           (1U<<21)    /**< STALL handshake.           */
#define DIEPCTL_SNPM            (1U<<20)    /**< Snoop mode.                */
#define DIEPCTL_EPTYPE_MASK      (3<<18)     /**< Endpoint type mask.        */
#define DIEPCTL_EPTYPE_CTRL      (0U<<18)    /**< Control.                   */
#define DIEPCTL_EPTYPE_ISO       (1U<<18)    /**< Isochronous.               */
#define DIEPCTL_EPTYPE_BULK      (2U<<18)    /**< Bulk.                      */
#define DIEPCTL_EPTYPE_INTR      (3U<<18)    /**< Interrupt.                 */
#define DIEPCTL_NAKS          (1U<<17)    /**< NAK status.                */
#define DIEPCTL_EONUM           (1U<<16)    /**< Even/odd frame.            */
#define DIEPCTL_DPID            (1U<<16)    /**< Endpoint data PID.         */
#define DIEPCTL_EPACT          (1U<<15)    /**< USB active endpoint.       */
#define DIEPCTL_MPL_MASK      (0x3FFU<<0) /**< Maximum Packet size mask.  */
#define DIEPCTL_MPL(n)        ((n)<<0)    /**< Maximum Packet size value. */
/** @} */

/**
 * @name DIEPINTF register bit definitions
 * @{
 */
#define DIEPINTFF_TXFE            (1U<<7)     /**< Transmit FIFO empty.       */
#define DIEPINTFF_IEPNE          (1U<<6)     /**< IN endpoint NAK effective. */
#define DIEPINTFF_EPTXFUD          (1U<<4)     /**< IN Token received when
                                                 TxFIFO is empty.           */
#define DIEPINTFF_CITO             (1U<<3)     /**< Timeout condition.         */
#define DIEPINTFF_EPDIS          (1U<<1)     /**< Endpoint disabled
                                                 interrupt.                 */
#define DIEPINTFF_TF            (1U<<0)     /**< Transfer completed.        */
/** @} */

/**
 * @name DIEPLEN register bit definitions
 * @{
 */
#define DIEPLEN_MCPF_MASK      (3U<<29)    /**< Multi count mask.          */
#define DIEPLEN_MCPF(n)        ((n)<<29)   /**< Multi count value.         */
#define DIEPLEN_PCNT_MASK    (0x3FF<<19) /**< Packet count mask.         */
#define DIEPLEN_PCNT(n)      ((n)<<19)   /**< Packet count value.        */
#define DIEPLEN_TLEN_MASK    (0x7FFFFU<<0)/**< Transfer size mask.       */
#define DIEPLEN_TLEN(n)      ((n)<<0)    /**< Transfer size value.       */
/** @} */

/**
 * @name DIEPTFSTAT register bit definitions.
 * @{
 */
#define DIEPTFSTAT_IEPTFS_MASK  (0xFFFF<<0) /**< IN endpoint TxFIFO space
                                                 available.                 */
/** @} */

/**
 * @name DOEPCTL register bit definitions.
 * @{
 */
#define DOEPCTL_EPEN           (1U<<31)    /**< Endpoint enable.           */
#define DOEPCTL_EPD           (1U<<30)    /**< Endpoint disable.          */
#define DOEPCTL_SD1PID          (1U<<29)    /**< Set DATA1 PID.             */
#define DOEPCTL_SODDFRM         (1U<<29)    /**< Set odd frame.             */
#define DOEPCTL_SD0PID          (1U<<28)    /**< Set DATA0 PID.             */
#define DOEPCTL_SEVENFRM         (1U<<28)    /**< Set even frame.            */
#define DOEPCTL_SNAK            (1U<<27)    /**< Set NAK.                   */
#define DOEPCTL_CNAK            (1U<<26)    /**< Clear NAK.                 */
#define DOEPCTL_STALL           (1U<<21)    /**< STALL handshake.           */
#define DOEPCTL_SNOOP            (1U<<20)    /**< Snoop mode.                */
#define DOEPCTL_EPTYPE_MASK      (3U<<18)    /**< Endpoint type mask.        */
#define DOEPCTL_EPTYPE_CTRL      (0U<<18)    /**< Control.                   */
#define DOEPCTL_EPTYPE_ISO       (1U<<18)    /**< Isochronous.               */
#define DOEPCTL_EPTYPE_BULK      (2U<<18)    /**< Bulk.                      */
#define DOEPCTL_EPTYPE_INTR      (3U<<18)    /**< Interrupt.                 */
#define DOEPCTL_NAKS          (1U<<17)    /**< NAK status.                */
#define DOEPCTL_EOFRM           (1U<<16)    /**< Even/odd frame.            */
#define DOEPCTL_DPID            (1U<<16)    /**< Endpoint data PID.         */
#define DOEPCTL_EPACT          (1U<<15)    /**< USB active endpoint.       */
#define DOEPCTL_MPL_MASK      (0x3FFU<<0) /**< Maximum Packet size mask.  */
#define DOEPCTL_MPL(n)        ((n)<<0)    /**< Maximum Packet size value. */
/** @} */

/**
 * @name DOEPINTF register bit definitions
 * @{
 */
#define DOEPINTF_BTBSTP         (1U<<6)     /**< Back-to-back SETUP packets
                                                 received.                  */
#define DOEPINTF_EPRXFOVR         (1U<<4)     /**< OUT token received when
                                                 endpoint disabled.         */
#define DOEPINTF_STPF            (1U<<3)     /**< SETUP phase done.          */
#define DOEPINTF_EPDIS          (1U<<1)     /**< Endpoint disabled
                                                 interrupt.                 */
#define DOEPINTF_TF            (1U<<0)     /**< Transfer completed
                                                 interrupt.                 */
/** @} */

/**
 * @name DOEPLEN register bit definitions
 * @{
 */
#define DOEPLEN_RXDPID_MASK    (3U<<29)    /**< Received data PID mask.    */
#define DOEPLEN_RXDPID(n)      ((n)<<29)   /**< Received data PID value.   */
#define DOEPLEN_STPCNT_MASK   (3U<<29)    /**< SETUP packet count mask.   */
#define DOEPLEN_STPCNT(n)     ((n)<<29)   /**< SETUP packet count value.  */
#define DOEPLEN_PCNT_MASK    (0x3FFU<<19)/**< Packet count mask.         */
#define DOEPLEN_PCNT(n)      ((n)<<19)   /**< Packet count value.        */
#define DOEPLEN_TLEN_MASK    (0x7FFFFU<<0)/**< Transfer size mask.       */
#define DOEPLEN_TLEN(n)      ((n)<<0)    /**< Transfer size value.       */
/** @} */

/**
 * @name PWRCLKCTL register bit definitions
 * @{
 */
#define PWRCLKCTL_SHCLK        (1U<<1)     /**< Gate HCLK.                 */
#define PWRCLKCTL_SUCLK         (1U<<0)     /**< Stop PCLK.                 */
/** @} */

#define USBFS_ADDR                 0x50000000

/**
 * @brief   Accesses to the USBFS registers block.
 */
#define USBFS                      ((gd32_usbfs_t *)USBFS_ADDR)

#endif /* GD32_USBFS_H */

/** @} */
